from time import sleep

# Settings
print("===============================================================================")
print("Преди да започнем, моля въведете име с което искате да продължите!")
name = input()
score = 0
total_questions = 10

# Introduction
print("===============================================================================")
print(f"\nЗдравей {name}, добре дошъл в Quiz играта на Николай!")
sleep(3)
print("Тук ще ти задам 10 въпроса, като ти трябва да отговориш с някой от изброените отговори"
      "(A) , (B) , (C) , (D);")
sleep(3)
print("За всеки правилен отговор, ще получаваш по 1 точка.")
sleep(5)
print("\n===============================================================================")
print("========================[Ако си готов, само ми дай знак!]======================")
print("===============================================================================")
print("======================== [Y] CONTINUE / [N] EXIT GAME =========================")
print("===============================================================================")

# Continue or Exit
answer1 = str(input()).lower()
if answer1 == "y":
    score += 1
    print("\nЧудесно, за желание получаваш 1 точка!")
    print("Нека продължим със следващият въпрос!")
    print("===============================================================================")
else:
    print("\nТова беше първият ти грешен отговор =(")
    print("Но, не губи надежда! Иматш още 9 въпроса! Успех!")
    print("===============================================================================")
sleep(3)

# Question 2
print("\nВъпрос №2: Коя е любимата игра на Николай?")
print("A: Minecraft")
print("B: Counter-Strike: Global Offensive")
print("C: World of Warcraft")
print("D: Need for Speed")

answer2 = str(input()).lower()
sleep(1)
if answer2 == "c":
    score += 1
print("Хмм.. интересно...")
print("===============================================================================")
sleep(2)

# Question 3
print("\nВъпрос №3: Кой е любимият цвят на Николай?")
print("A: Оранжево")
print("B: Бяло")
print("C: Синьо")
print("D: Черно")

answer3 = str(input()).lower()
if answer3 == "a":
    score += 1
    print("Хах.. дали?")
    print("===============================================================================")
else:
    print("Хах.. дали?")
    print("===============================================================================")
sleep(2)

# Question 4
print("\nВъпрос №4: Кой е любимият му филм?")
print("A: The Avengers (Отмъстителите)")
print("B: The Godfather (Кръстникът)")
print("C: American Pie (Американски Пай)")
print("D: 8 Mile (Осмата Миля)")

answer4 = str(input()).lower()
if answer4 == "d":
    score += 1
    print("Всичките са толкова яки... това беше труден въпрос!")
    print("===============================================================================")
else:
    print("Всичките са толкова яки... това беше труден въпрос!")
    print("===============================================================================")
sleep(2)

# Question 5
print("\nВъпрос №5: Коя марка телефони предпочита?")
print("A: Samsung")
print("B: Apple")
print("C: Xiaomi")
print("D: Huawei")

answer5 = str(input()).lower()
if answer5 == "c":
    score += 1
    print("Подсказка. Определенно е Android!")
    print("===============================================================================")
else:
    print("Подсказка. Определенно е Android!")
    print("===============================================================================")
sleep(3)

# Half Game!

print("\n\nУау.. вече отговори на 5 въпроса!")
print("Нека малко вдигнем трудноста и ти задам малко по-сложни въпроси!")
print(f"Преди това, един интересен факт! Тази игра е направена лично от Николай! Той започна да учи езика 'Python' "
      f"преди 3 дни и това е първият му проект.")
print(f"Според теб, {name}, добре ли се е справил? (Обещавам, това няма да влияе "
      f"на резултатът ти!)")

print("\n\nМоля оценете по скалата от 1 до 10 колко добре се е справил Николай?")
answer_rate = int(input())
print("Благодаря ти! Оценяваме твоята оценка!")
sleep(1)
print(f"Е {name}, нека продължим!")
sleep(2)
print("\n===============================================================================")
print("===============================================================================")

# Question 6
print("\nВъпрос №6: Кой е любимият му домашен любимец?")
print("A: Куче")
print("B: Котка")
print("C: Риба")
print("D: Хамстер")

answer6 = str(input()).lower()
if answer6 == "a":
    score += 1
    print("Куче, кажи мяу /  *Грух* / Егати Коня?! ")
    print("===============================================================================")
else:
    print("Куче, кажи мяу /  *Грух* / Егати Коня?! ")
    print("===============================================================================")
sleep(2)

# Question 7
print("\nВъпрос №7: Какъв цвят са очите му?")
print("A: Сини")
print("B: Кафяви")
print("C: Пъстри")
print("D: Черни")

answer7 = str(input()).lower()
if answer7 == "b":
    score += 1
    print("'Очите виждат само това, което умът е готов да разбере'- Анри бергсън ")
    print("===============================================================================")
else:
    print("'Очите виждат само това, което умът е готов да разбере'- Анри бергсън ")
    print("===============================================================================")
sleep(2)

# Question 8
print("\nВъпрос №8: Кой номер обувки носи?")
print("A: 48")
print("B: 45")
print("C: 47")
print("D: 46")

answer8 = str(input()).lower()
if answer8 == "c":
    score += 1
    print("С такива крака, спестяваш от плавници!")
    print("===============================================================================")
else:
    print("С такива крака, спестяваш от плавници!")
    print("===============================================================================")
sleep(2)

# Question 9
print("\nВъпрос №9: Кой е любимият му бранд обувки?")
print("A: Addidas")
print("B: Nike")
print("C: Puma")
print("D: Reebok")

answer9 = str(input()).lower()
if answer9 == "b":
    score += 1
    print("Друго си е обувките от Decathlon! 20лв и не ти дреме.")
    print("===============================================================================")
else:
    print("Друго си е обувките от Decathlon! 20лв и не ти дреме.")
    print("===============================================================================")

sleep(3)

# Before Last Question
print(f"\n\nЕхаа.. Стигна до последният въпрос. Преди да го задам, искам да ти благодаря за търпението и желанието "
      f"да стигнеш до край!")
sleep(1)
print(f"Стига съм те бавил, нека продължим. И отново, благодаря ти {name}!! ")
sleep(5)

# Question 10
print("\nВъпрос №10: Кога е рожденната дата на Николай?")
print("A: 28.10.1997")
print("B: 28.01.1997")
print("C: 18.10.1997")
print("D: 18.01.1997")

answer10 = str(input()).lower()
if answer10 == "b":
    score += 1
    print("Най-накрая! Дай ми 10 секунди да сметна точките!")
    print("===============================================================================")
else:
    print("Най-накрая! Дай ми 10 секунди да сметна точките!")
    print("===============================================================================")

# Results
sleep(2)
print("...")
sleep(3)
print("...")
sleep(2)
print("...")
sleep(3)
print("\n\nГотов съм! А ти готов ли си?")
print("Да(Y) / Не(N)")
answer_ready = str(input().lower())
sleep(1)

print(f"\nРезултатът ти е {score}/{total_questions}!")
sleep(1)
if score >= 9:
    print("Отлично представяне!")
elif score >= 7:
    print("Много добре!")
elif score >= 4:
    print("С Николай, май се познавате от скоро?")
elif score >= 2:
    print("Сигурен ли си че го познаваш или само сте се виждали 1-2 пъти?")
else:
    print("За един и същ Николай ли говорим???")
sleep(5)
print("===============================================================================")
print("Е, това беше от мен. Благодаря ти за пореден път че довърши играта заедно с мен. "
      "\nБлагодаря ти и за оценката"
      f" ({answer_rate}) която ни даде по-рано.")
sleep(1)

print("Желаеш ли да видиш отговорите на въпросите?")
print("Отговори с [Y] за да или [N] за не!")
yes_question = str(input()).lower()
if yes_question == "y":
    print(f"{name}, ето ги и отговорите!")
    sleep(3)
    print(f"\nВъпрос №1: Ако си готов, само ми дай знак!")
    print("Отговорът е: Да(Y)")
    sleep(3)
    print(f"\nВъпрос №2: Коя е любимата игра на Николай?")
    print("Отговорът е:World of Warcraft")
    sleep(3)
    print(f"\nВъпрос №3: Кой е любимият цвят на Николай?")
    print("Отговорът е:Оранжево")
    sleep(3)
    print(f"\nВъпрос №4: Кой е любимият му филм?")
    print("Отговорът е:8 Mile (Осмата Миля)")
    sleep(3)
    print(f"\nВъпрос №5: Коя марка телефони предпочита?")
    print("Отговорът е:Xiaomi")
    sleep(3)
    print(f"\nВъпрос №6: Кой е любимият му домашен любимец?")
    print("Отговорът е:Куче")
    sleep(3)
    print(f"\nВъпрос №7: Какъв цвят са очите му?")
    print("Отговорът е:Кафяви")
    sleep(3)
    print(f"\nВъпрос №8: Кой номер обувки носи?")
    print("Отговорът е:47")
    sleep(3)
    print(f"\nВъпрос №9: Кой е любимият му бранд обувки?")
    print("Отговорът е:Nike")
    sleep(3)
    print(f"\nВъпрос №10: Кога е рожденната дата на Николай?")
    print("Отговорът е:28.01.1997")
    sleep(3)

print("\nПожелавам ти лек и спорен ден. Ще се видим скоро!")
sleep(8)

sleep(15)
print("\n\n\n-------------------------------------------------------------------------------------------------------"
      "---------------")
print("------|||||||||||||||---|||-------|||---|||||||||------------|||||||||----||||-----|||---|||||||-------------"
      "---------")
print("-------------|||--------|||-------|||---|||------------------|||----------|||||----|||---|||---|||-----------"
      "---------")
print("-------------|||--------|||-------|||---|||------------------|||----------|||-||---|||---|||----|||----------"
      "---------")
print("-------------|||--------|||||||||||||---|||||||||------------|||||||||----|||--||--|||---|||-----|||---------"
      "---------")
print("-------------|||--------|||-------|||---|||------------------|||----------|||---||-|||---|||----|||----------"
      "---------")
print("-------------|||--------|||-------|||---|||------------------|||----------|||----|||||---|||---|||-----------"
      "---------")
print("-------------|||--------|||-------|||---|||||||||------------|||||||||----|||-----||||---|||||||-------------"
      "---------")
print("-------------------------------------------------------------------------------------------------------------"
      "---------")
